PWS_Lab4/PWS_Lab4_RequestCollection_Insomnia.json

{"_type":"export","__export_format":4,"__export_date":"2024-01-05T14:31:52.085Z","__export_source":"insomnia.desktop.app:v2023.5.8","resources":[{"_id":"req_a16b6c1117fc40ea93d6fa64d7dede8e","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755768422,"created":1703699714205,"url":"http://localhost:50681/Simplex.asmx","name":"Add (SOAP 1.1)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope\n\txmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n\txmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n\txmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n\t<soap:Body>\n\t\t<Add\n\t\t\txmlns=\"http://vad/\">\n\t\t\t<x>10</x>\n\t\t\t<y>2</y>\n\t\t</Add>\n\t</soap:Body>\n</soap:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755676991,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"wrk_e432cb74a067447f8f2942c601b4333b","parentId":null,"modified":1703792406758,"created":1703684060528,"name":"PWS_4","description":"","scope":"collection","_type":"workspace"},{"_id":"req_c10dc96712f7476e95f90566d33fccd9","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755731589,"created":1703755725445,"url":"http://localhost:50681/Simplex.asmx","name":"Add (SOAP 1.2)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://vad/\">\n      <x>10</x>\n      <y>2</y>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755671816,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_d0a3b55bc2354bdfb7344cde5299087b","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755696181,"created":1703699808142,"url":"http://localhost:50681/Simplex.asmx/Add","name":"Add (HTTP POST)","description":"","method":"POST","body":{"mimeType":"application/x-www-form-urlencoded","params":[{"id":"pair_27217390b8404b0597a3c696478de437","name":"x","value":"10","description":""},{"id":"pair_cc667b48ac714979a39653f3716b674c","name":"y","value":"2","description":""}]},"parameters":[],"headers":[{"name":"Content-Type","value":"application/x-www-form-urlencoded"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755666641,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_470941ee5dc44dc4aaea7d89760598a7","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755697142,"created":1703684077622,"url":"http://localhost:50681/Simplex.asmx","name":"Sum (SOAP 1.1)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Sum xmlns=\"http://vad/\">\n      <a1>\n        <s>zxc</s>\n        <k>1</k>\n        <f>2</f>\n      </a1>\n      <a2>\n        <s>qwe</s>\n        <k>4</k>\n        <f>5</f>\n      </a2>\n    </Sum>\n  </soap:Body>\n</soap:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755664916,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_e626295359fc4f538bb5581a30eec6a5","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755698061,"created":1703699936115,"url":"http://localhost:50681/Simplex.asmx","name":"Sum (SOAP 1.2)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Sum xmlns=\"http://vad/\">\n      <a1>\n        <s>zxc</s>\n        <k>1</k>\n        <f>2</f>\n      </a1>\n      <a2>\n        <s>asd</s>\n        <k>2</k>\n        <f>3</f>\n      </a2>\n    </Sum>\n  </soap12:Body>\n</soap12:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755664053.5,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_d60a78bd57bc43579e0aedb394d79d40","parentId":"fld_cb3be93882764fdb9512c5e130bb9455","modified":1703755817673,"created":1703755701059,"url":"http://localhost:1488/Simplex.asmx","name":"Add (SOAP 1.1)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope\n\txmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n\txmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n\txmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n\t<soap:Body>\n\t\t<Add\n\t\t\txmlns=\"http://vad/\">\n\t\t\t<x>10</x>\n\t\t\t<y>2</y>\n\t\t</Add>\n\t</soap:Body>\n</soap:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755702562,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_cb3be93882764fdb9512c5e130bb9455","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703755663191,"created":1703755663191,"name":"IIS","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1703755663191,"_type":"request_group"},{"_id":"req_09cc67b38b614195a7e360231295e8f8","parentId":"fld_cb3be93882764fdb9512c5e130bb9455","modified":1703755719314,"created":1703699752412,"url":"http://localhost:1488/Simplex.asmx","name":"Add (SOAP 1.2)","description":"","method":"POST","body":{"mimeType":"application/xml","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://vad/\">\n      <x>10</x>\n      <y>2</y>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>"},"parameters":[],"headers":[{"name":"Content-Type","value":"text/xml","id":"pair_ec162f9fde204aa4b83f9ce518b1fb85"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755702462,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_8994513a6af5496598f9678964b6fd64","parentId":"fld_cb3be93882764fdb9512c5e130bb9455","modified":1703755738073,"created":1703755734069,"url":"http://localhost:1488/Simplex.asmx/Add","name":"Add (HTTP POST)","description":"","method":"POST","body":{"mimeType":"application/x-www-form-urlencoded","params":[{"id":"pair_27217390b8404b0597a3c696478de437","name":"x","value":"10","description":""},{"id":"pair_cc667b48ac714979a39653f3716b674c","name":"y","value":"2","description":""}]},"parameters":[],"headers":[{"name":"Content-Type","value":"application/x-www-form-urlencoded"},{"name":"User-Agent","value":"insomnia/2023.5.8","id":"pair_1b850847c8be482e807c633df9ef7bac"}],"authentication":{},"metaSortKey":-1703755702362,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"env_3d6170299b717670baaf4d528ef5fe8f3a346590","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703684060542,"created":1703684060542,"name":"Base Environment","data":{},"dataPropertyOrder":null,"color":null,"isPrivate":false,"metaSortKey":1703684060542,"_type":"environment"},{"_id":"jar_3d6170299b717670baaf4d528ef5fe8f3a346590","parentId":"wrk_e432cb74a067447f8f2942c601b4333b","modified":1703684060546,"created":1703684060546,"name":"Default Jar","cookies":[],"_type":"cookie_jar"}]}