PWS_Lab4/PWS_Lab4_RequestCollection_Postman.json

{"info":{"_postman_id":"11d8f1f9-c0d0-4ff8-a475-23e14bc0974f","name":"requests","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json"},"item":[{"name":"Sum (SOAP 1.1)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Sum xmlns=\"http://vad/\">\n      <a1>\n        <s>zxc</s>\n        <k>1</k>\n        <f>2</f>\n      </a1>\n      <a2>\n        <s>qwe</s>\n        <k>4</k>\n        <f>5</f>\n      </a2>\n    </Sum>\n  </soap:Body>\n</soap:Envelope>"},"url":{"raw":"http://localhost:50681/Simplex.asmx","protocol":"http","host":["localhost:50681"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"Add (SOAP 1.1)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope\n\txmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n\txmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n\txmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n\t<soap:Body>\n\t\t<Add\n\t\t\txmlns=\"http://vad/\">\n\t\t\t<x>10</x>\n\t\t\t<y>2</y>\n\t\t</Add>\n\t</soap:Body>\n</soap:Envelope>"},"url":{"raw":"http://localhost:50681/Simplex.asmx","protocol":"http","host":["localhost:50681"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"Add (HTTP POST)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"application/x-www-form-urlencoded"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"urlencoded","urlencoded":[{"key":"x","value":"10"},{"key":"y","value":"2"}]},"url":{"raw":"http://localhost:50681/Simplex.asmx/Add","protocol":"http","host":["localhost:50681"],"path":["Simplex.asmx","Add"]},"auth":{}},"response":[]},{"name":"Sum (SOAP 1.2)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Sum xmlns=\"http://vad/\">\n      <a1>\n        <s>zxc</s>\n        <k>1</k>\n        <f>2</f>\n      </a1>\n      <a2>\n        <s>asd</s>\n        <k>2</k>\n        <f>3</f>\n      </a2>\n    </Sum>\n  </soap12:Body>\n</soap12:Envelope>"},"url":{"raw":"http://localhost:50681/Simplex.asmx","protocol":"http","host":["localhost:50681"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"Add (SOAP 1.2)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://vad/\">\n      <x>10</x>\n      <y>2</y>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>"},"url":{"raw":"http://localhost:50681/Simplex.asmx","protocol":"http","host":["localhost:50681"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"IIS","item":[{"name":"Add (SOAP 1.2)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://vad/\">\n      <x>10</x>\n      <y>2</y>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>"},"url":{"raw":"http://localhost:1488/Simplex.asmx","protocol":"http","host":["localhost:1488"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"Add (SOAP 1.1)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"text/xml"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope\n\txmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n\txmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n\txmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n\t<soap:Body>\n\t\t<Add\n\t\t\txmlns=\"http://vad/\">\n\t\t\t<x>10</x>\n\t\t\t<y>2</y>\n\t\t</Add>\n\t</soap:Body>\n</soap:Envelope>"},"url":{"raw":"http://localhost:1488/Simplex.asmx","protocol":"http","host":["localhost:1488"],"path":["Simplex.asmx"]},"auth":{}},"response":[]},{"name":"Add (HTTP POST)","request":{"description":"","method":"POST","header":[{"key":"Content-Type","value":"application/x-www-form-urlencoded"},{"key":"User-Agent","value":"insomnia/2023.5.8"}],"body":{"mode":"urlencoded","urlencoded":[{"key":"x","value":"10"},{"key":"y","value":"2"}]},"url":{"raw":"http://localhost:1488/Simplex.asmx/Add","protocol":"http","host":["localhost:1488"],"path":["Simplex.asmx","Add"]},"auth":{}},"response":[]}]}]}